app/controllers/admin/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "is_published", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hi eric"], ["created_at", Tue, 11 Mar 2014 21:46:03 UTC +00:00], ["is_published", true], ["title", "Test Post"], ["updated_at", Tue, 11 Mar 2014 21:46:03 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "is_published" = $1, "updated_at" = $2 WHERE "posts"."id" = 1  [["is_published", false], ["updated_at", Tue, 11 Mar 2014 23:01:47 UTC +00:00]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(post_params)